from pyrx import Db


class TestPyDbCore:

    def test_utf8_wstr(self):
        actual = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""
        assert Db.Core.stringTest(actual) == actual

    def test_tolower(self):
        lower = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""

        upper = """ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞ
        ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŸ
        ĄĆĘŁŃÓŚŹŻ"""

        assert Db.Core.stringtolower(upper) == lower

    def test_toupper(self):
        lower = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""

        upper = """ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞ
        ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŸ
        ĄĆĘŁŃÓŚŹŻ"""

        assert Db.Core.stringtoupper(lower) == upper

    def test_icompare(self):
        lower = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""

        upper = """ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞ
        ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŸ
        ĄĆĘŁŃÓŚŹŻ"""
        assert Db.Core.icompare(upper, lower) == True
