from pyrx import Ap


class TestPyDbCore:

    def test_utf8_wstr(self):
        actual = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""
        assert Ap.Internal.stringTest(actual) == actual

    def test_tolower(self):
        lower = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""

        upper = """ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞ
        ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŸ
        ĄĆĘŁŃÓŚŹŻ"""

        assert Ap.Internal.stringtolower(upper) == lower

    def test_toupper(self):
        lower = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""

        upper = """ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞ
        ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŸ
        ĄĆĘŁŃÓŚŹŻ"""

        assert Ap.Internal.stringtoupper(lower) == upper

    def test_icompare(self):
        lower = """àáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ
        āăąćĉċčďđēĕėęěĝğġģĥħĩīĭįİĳĵķĺļľŀłńņňŋōŏőœŕŗřśŝşšţťŧũūŭůűųŵŷÿ
        ąćęłńóśźż"""

        upper = """ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞ
        ĀĂĄĆĈĊČĎĐĒĔĖĘĚĜĞĠĢĤĦĨĪĬĮİĲĴĶĹĻĽĿŁŃŅŇŊŌŎŐŒŔŖŘŚŜŞŠŢŤŦŨŪŬŮŰŲŴŶŸ
        ĄĆĘŁŃÓŚŹŻ"""
        assert Ap.Internal.icompare(upper, lower) == True
